# Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n и выведите на экран их сумму.
# in
# 6
# out
# [2.0, 2.25, 2.37, 2.441, 2.488, 2.522]


print('Введите число')
list_1 = []
l_num = int(input())
for k in range(1,l_num+1):
    list_1.append((1 + 1/k) ** k)
    print(list_1)